In [84]:
# Q.1 List any five functions of the pandas library with execution.
# Ans:
# Following are the functions of the pandas:

# 1. read_csv: This function is used to read data from a CSV file and create a DataFrame.
import pandas as pd
df=pd.read_csv("data.csv")

In [85]:
df

    Name  Age      City
0   John   25  New York
1   Emma   28    London
2  Alice   32     Paris

In [86]:
# 2. read_xlsx:  This function is used to read data from a excel file and create a DataFrame.
df1=pd.read_excel("sanjana.xlsx")

In [87]:
df1.head()

   Sanjana Shinde  Unnamed: 1  Numbers  Unnamed: 3  Squares  Unnamed: 5  cubes
0             NaN         NaN        1         NaN        1         NaN      1
1             NaN         NaN        2         NaN        4         NaN      8
2             NaN         NaN        3         NaN        9         NaN     27
3             NaN         NaN        4         NaN       16         NaN     64
4             NaN         NaN        5         NaN       25         NaN    125

In [88]:
# 3.info(): This function provides a summary of the DataFrame, including the column names, data types, and memory usage.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [89]:
# 4. describe(): Generate descriptive statistics.
df.describe()

             Age
count   3.000000
mean   28.333333
std     3.511885
min    25.000000
25%    26.500000
50%    28.000000
75%    30.000000
max    32.000000

In [90]:
# head(): This function returns the first n rows of the DataFrame. By default, it returns the first 5 rows.
df1.head()

   Sanjana Shinde  Unnamed: 1  Numbers  Unnamed: 3  Squares  Unnamed: 5  cubes
0             NaN         NaN        1         NaN        1         NaN      1
1             NaN         NaN        2         NaN        4         NaN      8
2             NaN         NaN        3         NaN        9         NaN     27
3             NaN         NaN        4         NaN       16         NaN     64
4             NaN         NaN        5         NaN       25         NaN    125

In [91]:
# Q.2 Given a Pandas Dataframe df with column 'A','B',and 'c' write a python function to re-index the Dataframe with a new index that starts from 1 and
#      increments by 2 for each row.
# Ans:
data={"A":[1,2,3,4,5],
     "B":["siya","disha","fatima","riya","sanika"],
      "C":[23,34,45,52,34]}

In [92]:
df=pd.DataFrame(data)

In [93]:
df

   A       B   C
0  1    siya  23
1  2   disha  34
2  3  fatima  45
3  4    riya  52
4  5  sanika  34

In [94]:
def reindex(df):
    new_index= pd.Index(range(1, len(df) * 2 + 1, 2))
    new_df = df.set_index(new_index)
    return new_df

In [95]:
new_df = reindex(df)
new_df

   A       B   C
1  1    siya  23
3  2   disha  34
5  3  fatima  45
7  4    riya  52
9  5  sanika  34

In [96]:
# Q.3 You have a pandas Dataframe df with a column named 'Values'. Write a python function that iterates over the Dataframe and calculates the first 
#     three values in the "Values" column . The function should print the sum to the console.
#     For example,
#          If the"Values" column the values [10,20,30,40,50],your function should calculate and print sum of the first three values,which is 60.

# Ans:
df=pd.DataFrame({"Values":[20,40,60,80,100]})

In [97]:
df

   Values
0      20
1      40
2      60
3      80
4     100

In [98]:
def cal_sum(df):
    values=df['Values'].values[:3]
    total_sum=sum(values)
    print("Sum of first three numbers is :",total_sum)

In [99]:
cal_sum(df)

Sum of first three numbers is : 120

In [100]:
# Q.4 Given a Pandas Dataframe df with a column 'Text',write a Python function to create a new column 'Wrod_count' that contains the number
#    of words in each row of the 'Text' column.
# Ans:
import pandas as pd
df2=pd.DataFrame({"Text":['That was a great day ','It was great','Nice to see that','Something is wrong','Nice to meet you']})

In [101]:
df2

                    Text
0  That was a great day
1           It was great
2       Nice to see that
3     Something is wrong
4       Nice to meet you

In [102]:
df2['Word_count']=df2['Text'].apply(lambda x:len(x.split()))

In [103]:
df2

                    Text  Word_count
0  That was a great day            5
1           It was great           3
2       Nice to see that           4
3     Something is wrong           3
4       Nice to meet you           4

In [104]:
# Q.5 How are DataFrame.size() and DataFrame.shape() different ?
# Ans:
# 1.DataFrame.size():
#     DataFrame.size(): The size() method returns the total number of elements in the DataFrame. It calculates the size by multiplying the number of 
#  rows
# Example:
data2={"numbers":[2,3,4,5,6],"Squares":[4,9,16,25,36]}
df3=pd.DataFrame(data2)
df3

   numbers  Squares
0        2        4
1        3        9
2        4       16
3        5       25
4        6       36

In [105]:
df3.size

10

In [106]:
# Explaination:
#   In this example, the DataFrame has 3 rows and 2 columns, so the total number of elements is 5 * 2 = 10.

In [107]:
# 2.DataFrame.shape():
#     The shape() method returns a tuple representing the dimensions of the DataFrame. It provides information about the number of rows and columns in
# the DataFrame.
# Example:
df3.shape

(5, 2)

In [108]:
#  Explaination:
#      In this example, the DataFrame has 3 rows and 2 columns, so the shape is represented as (3, 2).

In [109]:
# Q.6 Which function of pandas do we use to read an excel file?
# Ans:
#    To read an Excel file using Pandas, we can use the read_excel() function

In [110]:
# Q.7  You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'.
#     Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
#     The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com',
#     the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 
#     'Username' column.

# Ans:
import pandas as pd
data2={'Email':['amitsharma@gmail.com','diya234@gmail.com','Soniyashi23@gmail.com']}
df=pd.DataFrame(data2)
df

                   Email
0   amitsharma@gmail.com
1      diya234@gmail.com
2  Soniyashi23@gmail.com

In [111]:
def extract_email(df):
    df['Username']=df['Email'].str.split('@').str[0]

In [112]:
extract_email(df)
df

                   Email     Username
0   amitsharma@gmail.com   amitsharma
1      diya234@gmail.com      diya234
2  Soniyashi23@gmail.com  Soniyashi23

In [113]:
# Q.8 You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is 
#     greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
#     For example, if df contains the following values:
#       A B C
#     0 3 5 1
#     1 8 2 7
#     2 6 9 4
#     3 2 3 5
#     4 9 1 2

#     Your function should select the following rows: A B C
#     1 8 2 7
#     4 9 1 2
#     The function should return a new DataFrame that contains only the selected rows.

# Ans:
data={"A":[2,9,4,6,3],"B":[4,3,5,6,7],"C":[4,3,5,6,7]}
df=pd.DataFrame(data)
df

   A  B  C
0  2  4  4
1  9  3  3
2  4  5  5
3  6  6  6
4  3  7  7

In [ ]:
def select_rows(df):
    selected_rows=df[(df['A']>5) & (df['B']<10)]
    return selected_rows

In [ ]:
selected_df = select_rows(df)

In [ ]:
selected_df

In [ ]:
# Q.9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values
#     in the 'Values' column.

# Ans:
data={"Values":[24,45,56,25]}
df=pd.DataFrame(data)

In [ ]:
def calculate(df):
    mean=df['Values'].mean()
    median=df['Values'].median()
    standard_deviation=df['Values'].std()
    return mean,median,standard_deviation

In [ ]:
mean,median,standard_deviation=calculate(df)
print('Mean',mean)
print('Median',median)
print('Standard deviation',standard_deviation)

In [ ]:
# Q.10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that 
#       contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a
#       window of size 7 and should include the current day.

# Ans:
data = {'Sales': [10, 15, 12, 8, 20, 17, 9, 14, 16, 22, 18, 13],
        'Date': pd.date_range(start='1/1/2022', periods=12)}
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:

def moving_average(df):
    df['MovingAverage']=df['Sales'].rolling(window=7, min_periods=1).mean()

In [ ]:
moving_average(df)
df

In [ ]:
# Q.11 You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame.The 'Weekday' 
#       column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
#       For example, if df contains the following values:
#          Date
#       0 2023-01-01
#       1 2023-01-02
#       2 2023-01-03
#       3 2023-01-04
#       4 2023-01-05
#       Your function should create the following DataFrame:

#              Date Weekday
#       0 2023-01-01 Sunday
#       1 2023-01-02 Monday
#       2 2023-01-03 Tuesday
#       3 2023-01-04 Wednesday
#       4 2023-01-05 Thursday
#       The function should return the modified DataFrame.

# Ans:
data = {'Date': pd.to_datetime(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05','2023-01-06','2023-01-07'])}
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
def add_weekday_column(df):
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

In [ ]:
df = add_weekday_column(df)

In [ ]:
df

In [ ]:
# Q.12 Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between
#      '2023-01-01' and '2023-01-31'.

# Ans:
data = {'Date': pd.to_datetime(['2022-12-31', '2023-01-15', '2023-01-31', '2023-02-10'])}
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
def select_rows_between_dates(df):
    start_date = pd.to_datetime('2023-01-01')
    end_date = pd.to_datetime('2023-01-31')
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    return selected_rows

In [ ]:
 select_rows_between_dates(df)

In [ ]:
# Q.13 To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?
# Ans:
#     The first and foremost necessary library that needs to be imported to use the basic functions of pandas is the pandas library itself. You need to
# import the pandas library in order to create and manipulate DataFrames, perform data analysis tasks, and use various functions provided by the pandas
# library.

# Here's an example of importing the pandas library:
# import pandas as pd

#     By convention, pd is commonly used as an alias for the pandas library to make it easier to refer to the library's functions and classes 
# throughout the code. Once you import the pandas library, you can use its functions and classes by prefixing them with pd, such as pd.DataFrame(), 
# pd.read_csv(), pd.concat(), and so on.